apple-open-source/macos/IOUSBFamily/AppleUSBEHCI/Classes/AppleUSBEHCI.cpp
    return stat;
}



AppleEHCIIsochEndpointPtr
AppleUSBEHCI::FindIsochronousEndpoint(
									  short 					functionAddress,
									  short					endpointNumber,
									  short 					direction,
									  AppleEHCIIsochEndpointPtr			*ppEPBack)
{
    AppleEHCIIsochEndpointPtr			pEP, pBack;
    
    pEP = _isochEPList;
    pBack = NULL;
    while (pEP)
    {
		if ((pEP->functionAddress == functionAddress)
			&& (pEP->endpointNumber == endpointNumber)
			&& (pEP->direction == direction))
			break;
		pBack = pEP;
		pEP = pEP->nextEP;
    }
    if (pEP && ppEPBack)
		*ppEPBack = pBack;
    return pEP;
}



AppleEHCIIsochEndpointPtr
AppleUSBEHCI::CreateIsochronousEndpoint(short 					functionAddress,
										short					endpointNumber,
										short 					direction,
										USBDeviceAddress		highSpeedHub,
										int						highSpeedPort)
{
    AppleEHCIIsochEndpointPtr			pEP;
	int									i;
    
    pEP = AllocateIsochEP();
    if (pEP)
    {
		pEP->toDoList = NULL;
		pEP->toDoEnd = NULL;
		pEP->doneQueue = NULL;
		pEP->doneEnd = NULL;
		pEP->deferredQueue = NULL;
		pEP->deferredEnd = NULL;
		pEP->firstAvailableFrame = 0;
		pEP->accumulatedStatus = kIOReturnSuccess;
		pEP->inSlot = 0;
		pEP->activeTDs = 0;
		pEP->onToDoList = 0;
		pEP->onDoneQueue = 0;
		pEP->scheduledTDs = 0;
		pEP->deferredTDs = 0;
		pEP->onProducerQ = 0;
		pEP->onReversedList = 0;
		pEP->functionAddress = functionAddress;
		pEP->endpointNumber = endpointNumber;
		pEP->direction = direction;
		pEP->highSpeedHub = highSpeedHub;
		pEP->highSpeedPort = highSpeedPort;
		pEP->hiPtr = NULL;
		for (i=0;i<8;i++)
			pEP->bandwidthUsed[i]=0;
		pEP->useBackPtr = false;
		pEP->aborting = false;
		pEP->nextEP = _isochEPList;
		_isochEPList = pEP;
    }
    return pEP;
}



IOReturn
AppleUSBEHCI::message( UInt32 type, IOService * provider,  void * argument )
{
    cs_event_t	pccardevent;
	
    // Let our superclass decide handle this method
    // messages
    //
    if ( type == kIOPCCardCSEventMessage)
    {
        pccardevent = (UInt32) argument;
		
        if ( pccardevent == CS_EVENT_CARD_REMOVAL )
        {
            // Should return all transactions in any endpoints
            //
            USBLog(5,"%s[%p]: Received kIOPCCardCSEventMessage Need to return all transactions",getName(),this);
            _pcCardEjected = true;
        }
    }
	
    USBLog(6, "%s[%p]::message type: %p, isInactive = %d", getName(), this, (void*)type, isInactive());
    return super::message( type, provider, argument );
	
}
